## amazing tips & tricks of pandas in one notebook

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
data=pd.read_csv('pollice data.csv',parse_dates=['stop_date'])
data[['stop_duration']].head()

  stop_duration
0      0-15 Min
1      0-15 Min
2      0-15 Min
3     16-30 Min
4      0-15 Min

In [5]:
data.head()

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,2005-01-02,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False
1,2005-01-18,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False
2,2005-01-23,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False
3,2005-02-20,17:15,NaN,M,1986.0,19.0,White,Call for Service,Other,False,NaN,Arrest Driver,True,16 30 Min,False
4,2005-03-14,10:00,NaN,F,1984.0,21.0,White,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False

In [4]:
data['stop_duration']=data['stop_duration'].str.replace("-","")
data[['stop_duration']].head()

  stop_duration
0      0 15 Min
1      0 15 Min
2      0 15 Min
3     16 30 Min
4      0 15 Min

In [18]:
data.stop_duration[:3]

0    0 15 Min
1    0 15 Min
2    0 15 Min
Name: stop_duration, dtype: object

In [8]:
# this is regular expression trick fetch the intger value from the string
data['stop_duration'].str.findall('\d')

0           [0, 1, 5]
1           [0, 1, 5]
2           [0, 1, 5]
3        [1, 6, 3, 0]
4           [0, 1, 5]
             ...
65530       [0, 1, 5]
65531       [0, 1, 5]
65532       [0, 1, 5]
65533             NaN
65534       [0, 1, 5]
Name: stop_duration, Length: 65535, dtype: object

In [9]:
# second option you can add same place as a string
data['stop_duration'].str.findall('\d+')

0         [0, 15]
1         [0, 15]
2         [0, 15]
3        [16, 30]
4         [0, 15]
           ...
65530     [0, 15]
65531     [0, 15]
65532     [0, 15]
65533         NaN
65534     [0, 15]
Name: stop_duration, Length: 65535, dtype: object

In [21]:
data['reduce_stop_durationtime']=data['stop_duration'].str.findall('\d+.\d+')
data['reduce_stop_durationtime'].head()

0     [0 15]
1     [0 15]
2     [0 15]
3    [16 30]
4     [0 15]
Name: reduce_stop_durationtime, dtype: object

In [16]:
for i ,row in data.iterrows():           # index and row
    
    if i==20:
        print('number of row :-',i)
        print()
        print(row)
        print('\n')
        print('printed the particular element with the help of row')
        print()
        print(row.stop_date)
        break
print()
print('we are printing only 20 index row')

number of row :- 20

stop_date             2005-07-28 00:00:00
stop_time                           12:37
country_name                          NaN
driver_gender                           F
driver_age_raw                     1979.0
driver_age                           26.0
driver_race                         Asian
violation_raw                    Speeding
violation                        Speeding
search_conducted                    False
search_type                           NaN
stop_outcome                     Citation
is_arrested                         False
stop_duration                    0 15 Min
drugs_related_stop                  False
Name: 20, dtype: object


printed the particular element with the help of row

2005-07-28 00:00:00

we are printing only 20 index row

In [19]:
#exercise for understanding
newlist=[]
for x in data['stop_date']:
#     print(x)
    for i,y in enumerate(x):
        try:
            newlist[i]=y.replace(' ','')
        except:
            newlist.append(y.replace(' ',''))
# # enumerate

TypeError: 'Timestamp' object is not iterable

In [23]:
data['reduce_stop_durationtime']

0         [0 15]
1         [0 15]
2         [0 15]
3        [16 30]
4         [0 15]
          ...
65530     [0 15]
65531     [0 15]
65532     [0 15]
65533        NaN
65534     [0 15]
Name: reduce_stop_durationtime, Length: 65535, dtype: object

In [22]:
#interesting method tricks but i have no suitable dataset so i could,nt run the proper
for i , row in data.iterrows():
    
    data.loc[i,'remove_spacecol']=row.driver_age+sum([int(x) for x in row.reduce_stop_durationtime])

ValueError: invalid literal for int() with base 10: '0 15'

In [51]:
# for i , row in data.iterrows():
#     data.loc[i,'edited_col']=[x.replace('-',',') for x in row.stop_duration]

In [24]:
data['driver_age_raw']=data['driver_age_raw'].astype(str)
data.driver_age_raw.dtypes

dtype('O')

In [25]:
data.dtypes

stop_date                   datetime64[ns]
stop_time                           object
country_name                       float64
driver_gender                       object
driver_age_raw                      object
driver_age                         float64
driver_race                         object
violation_raw                       object
violation                           object
search_conducted                      bool
search_type                         object
stop_outcome                        object
is_arrested                         object
stop_duration                       object
drugs_related_stop                    bool
reduce_stop_durationtime            object
dtype: object

### regular expression of python using in pandas

In [10]:
data.stop_duration[0:10]

0     0-15 Min
1     0-15 Min
2     0-15 Min
3    16-30 Min
4     0-15 Min
5     0-15 Min
6     0-15 Min
7     0-15 Min
8     0-15 Min
9     0-15 Min
Name: stop_duration, dtype: object

In [26]:
data.stop_duration.str.findall('\d')

0           [0, 1, 5]
1           [0, 1, 5]
2           [0, 1, 5]
3        [1, 6, 3, 0]
4           [0, 1, 5]
             ...
65530       [0, 1, 5]
65531       [0, 1, 5]
65532       [0, 1, 5]
65533             NaN
65534       [0, 1, 5]
Name: stop_duration, Length: 65535, dtype: object

## this is very important trick

In [27]:
for i ,j in data.iterrows():
    data.loc[i,'new_column']=j.driver_age
#this function is return index value and row of the entire dataframe
# this is for understanding but i don,t know why does not working
# then method when will be work then inside the driver_age_raw data list in form

In [29]:
data[['new_column','driver_age']]

       new_column  driver_age
0            20.0        20.0
1            40.0        40.0
2            33.0        33.0
3            19.0        19.0
4            21.0        21.0
...           ...         ...
65530        25.0        25.0
65531        58.0        58.0
65532        27.0        27.0
65533         NaN         NaN
65534        27.0        27.0

[65535 rows x 2 columns]

In [30]:
data['driver_age'].dtypes

dtype('float64')

In [38]:
data['driver_age'].isin(['.']).value_counts()

False    65535
Name: driver_age, dtype: int64

In [31]:
 for i ,j in data.iterrows():
    data.loc[i,'new_column2']=sum([int(x) for x in j.driver_age_raw])

ValueError: invalid literal for int() with base 10: '.'

In [39]:
data.head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop,reduce_stop_durationtime,new_column
0,2005-01-02,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False,[0 15],20.0
1,2005-01-18,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False,[0 15],40.0

In [21]:
pd.value_counts(data['violation_raw'])

Speeding                            37204
Other Traffic Violation             11926
Equipment/Inspection Violation       6516
Special Detail/Directed Patrol       2383
Registration Violation               2243
Call for Service                      793
Violation of City/Town Ordinance      170
Motorist Assist/Courtesy              138
APB                                    51
Suspicious Person                      38
Warrant                                10
Seatbelt Violation                      3
Name: violation_raw, dtype: int64

In [47]:
data['violation_raw'].value_counts(normalize=True),print(),data['driver_race'].value_counts(),data['stop_time'].value_counts()

(Speeding                            0.605189
 Other Traffic Violation             0.193998
 Equipment/Inspection Violation      0.105994
 Special Detail/Directed Patrol      0.038764
 Registration Violation              0.036486
 Call for Service                    0.012900
 Violation of City/Town Ordinance    0.002765
 Motorist Assist/Courtesy            0.002245
 APB                                 0.000830
 Suspicious Person                   0.000618
 Warrant                             0.000163
 Seatbelt Violation                  0.000049
 Name: violation_raw, dtype: float64,
 None,
 White       45747
 Black        8267
 Hispanic     5611
 Asian        1639
 Other         211
 Name: driver_race, dtype: int64,
 11:00    280
 10:00    280
 9:00     252
 10:30    251
 9:30     246
         ...
 5:42       1
 4:56       1
 5:25       1
 4:57       1
 4:54       1
 Name: stop_time, Length: 1432, dtype: int64)

In [48]:
data.pivot_table(columns='violation_raw',index='driver_race',values='stop_time',aggfunc=len)

violation_raw,APB,Call for Service,Equipment/Inspection Violation,Motorist Assist/Courtesy,Other Traffic Violation,Registration Violation,Seatbelt Violation,Special Detail/Directed Patrol,Speeding,Suspicious Person,Violation of City/Town Ordinance,Warrant
driver_race,,,,,,,,,,,,
Asian,NaN,17.0,130.0,2.0,242.0,29.0,NaN,45.0,1173.0,NaN,1.0,NaN
Black,6.0,97.0,1262.0,25.0,2076.0,503.0,1.0,603.0,3658.0,3.0,33.0,NaN
Hispanic,8.0,121.0,1069.0,12.0,1543.0,467.0,1.0,305.0,2062.0,5.0,16.0,2.0
Other,NaN,5.0,15.0,1.0,49.0,1.0,NaN,15.0,125.0,NaN,NaN,NaN
White,37.0,553.0,4040.0,98.0,8016.0,1243.0,1.0,1415.0,30186.0,30.0,120.0,8.0

In [53]:
data.pivot_table(columns='violation_raw',index='driver_race',values='stop_time',aggfunc=len).reset_index()['Call for Service'][0]

# i will prove how is this come 17

17.0

In [65]:
data[(data['violation_raw']=='Call for Service')& (data['driver_race']=='Asian')]['stop_time'].shape[0]

# prooved

17

# chiporders dataset

In [69]:
df=pd.read_csv('chip order.csv')

In [71]:
df.head(2)

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39

In [70]:
df.item_name.value_counts()

Chicken Bowl                             726
Chicken Burrito                          553
Chips and Guacamole                      479
Steak Burrito                            368
Canned Soft Drink                        301
Steak Bowl                               211
Chips                                    211
Bottled Water                            162
Chicken Soft Tacos                       115
Chips and Fresh Tomato Salsa             110
Chicken Salad Bowl                       110
Canned Soda                              104
Side of Chips                            101
Veggie Burrito                            95
Barbacoa Burrito                          91
Veggie Bowl                               85
Carnitas Bowl                             68
Barbacoa Bowl                             66
Carnitas Burrito                          59
Steak Soft Tacos                          55
6 Pack Soft Drink                         54
Chips and Tomatillo Red Chili Salsa       48
Chicken Crispy Tacos                      47
Chips and Tomatillo Green Chili Salsa     43
Carnitas Soft Tacos                       40
Steak Crispy Tacos                        35
Chips and Tomatillo-Green Chili Salsa     31
Steak Salad Bowl                          29
Nantucket Nectar                          27
Barbacoa Soft Tacos                       25
Chips and Roasted Chili Corn Salsa        22
Izze                                      20
Chips and Tomatillo-Red Chili Salsa       20
Veggie Salad Bowl                         18
Chips and Roasted Chili-Corn Salsa        18
Barbacoa Crispy Tacos                     11
Barbacoa Salad Bowl                       10
Chicken Salad                              9
Veggie Soft Tacos                          7
Carnitas Crispy Tacos                      7
Veggie Salad                               6
Carnitas Salad Bowl                        6
Burrito                                    6
Steak Salad                                4
Crispy Tacos                               2
Salad                                      2
Bowl                                       2
Chips and Mild Fresh Tomato Salsa          1
Veggie Crispy Tacos                        1
Carnitas Salad                             1
Name: item_name, dtype: int64

In [20]:
chickenbowl=df[df['item_name']=='Chicken Bowl']
chickenbowl.head()

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
13,13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25
19,19,10,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$8.75
26,26,13,1,Chicken Bowl,"[Roasted Chili Corn Salsa (Medium), [Pinto Bea...",$8.49

# changing the data type of item_price

In [23]:
chickenbowl['item_price'] = chickenbowl.item_price.str.replace("$","")

<ipython-input-23-36364cd7d9b9>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  chickenbowl['item_price'] = chickenbowl.item_price.str.replace("$","")
<ipython-input-23-36364cd7d9b9>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  chickenbowl['item_price'] = chickenbowl.item_price.str.replace("$","")

In [24]:
chickenbowl.head()

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
5,5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98
13,13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25
19,19,10,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",8.75
26,26,13,1,Chicken Bowl,"[Roasted Chili Corn Salsa (Medium), [Pinto Bea...",8.49

In [25]:
chickenbowl.item_price.dtypes

dtype('O')

In [26]:
chickenbowl['item_price'] = chickenbowl['item_price'].astype(float)

<ipython-input-26-5ea31032808f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  chickenbowl['item_price'] = chickenbowl['item_price'].astype(float)

In [27]:
chickenbowl.dtype
#dtype has b33n changed

Unnamed: 0              int64
order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

In [29]:
chickenbowl.isnull().sum()

Unnamed: 0            0
order_id              0
quantity              0
item_name             0
choice_description    0
item_price            0
dtype: int64

In [30]:
chickenbowl.head()

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
5,5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98
13,13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25
19,19,10,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",8.75
26,26,13,1,Chicken Bowl,"[Roasted Chili Corn Salsa (Medium), [Pinto Bea...",8.49

In [ ]:
#drop the unnamed column from the dataframe

In [ ]:
# create the pivot table for better understanding

In [49]:
chickenbowl.pivot_table(index='quantity',columns='order_id',values='item_price',aggfunc=sum )[926]

quantity
1    78.75
2      NaN
3      NaN
Name: 926, dtype: float64

In [51]:
chickenbowl.order_id.value_counts()
#id number 926 is present many

926     9
1786    5
491     4
205     4
759     3
       ..
364     1
362     1
360     1
359     1
1023    1
Name: order_id, Length: 615, dtype: int64

## pivot table for the ordr_id 1786 ,what quantity is purchased and what total price 
### and you can put the multiple values of columns in pivot table but it should declaire as a list

In [54]:
chickenbowl.pivot_table(index='quantity',columns='order_id',values='item_price')[1786]

quantity
1    10.25
2      NaN
3      NaN
Name: 1786, dtype: float64

In [55]:
chickenbowl.pivot_table(index='quantity',columns='order_id',values='item_price',aggfunc=sum)[1786]
# add total price of order_id 1786 by the aggfunc =sum
# according to this output quantity is 1 purchased many time because without aggfunc sum on price
# values is 10.25 but now value is increased it means quantity 1 is purchased many times bye the oderid 1786

quantity
1    51.25
2      NaN
3      NaN
Name: 1786, dtype: float64

In [52]:
chickenbowl[chickenbowl.order_id==926]

,order_id,quantity,item_name,choice_description,item_price
2305,926,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",8.75
2306,926,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",8.75
2307,926,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",8.75
2309,926,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",8.75
2312,926,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Lettuce]]",8.75
2313,926,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream...",8.75
2318,926,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",8.75
2321,926,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Rice, Pinto Beans,...",8.75
2322,926,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Rice, Cheese]]",8.75

In [48]:
chickenbowl.pivot_table(index='quantity',columns='order_id',values='item_price' )[926]

quantity
1    8.75
2     NaN
3     NaN
Name: 926, dtype: float64

In [73]:
df.head(2)

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39

In [74]:
import pandas as pd
import numpy as np
d=pd.DataFrame(np.arange(1,51).reshape(10,5),columns=list('ABCDE'))
d.style.background_gradient(cmap="coolwarm")

In [75]:
d.head() # it does not work always i wil learn it

    A   B   C   D   E
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

## backgroud changing trick in pivot table

In [80]:
df.pivot_table(index='quantity',columns='order_id',values='item_price',aggfunc=sum).style.background_gradient(cmap="coolwarm")

In [60]:
chickenbowl.sort_values(by='quantity')

,order_id,quantity,item_name,choice_description,item_price
2452,973,1,Chicken Bowl,"[Tomatillo Green Chili Salsa, [Rice, Black Bea...",8.75
3107,1240,1,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Roasted Chili Cor...",8.49
3124,1246,1,Chicken Bowl,"[Tomatillo Green Chili Salsa, [Rice, Pinto Bea...",8.75
3172,1268,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",8.75
3174,1269,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Rice, Fajita Veget...",11.25
...,...,...,...,...,...
415,181,2,Chicken Bowl,[Tomatillo Red Chili Salsa],17.50
4435,1767,2,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Pinto Beans, Chees...",17.50
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
1514,616,3,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",26.25
409,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",32.94

## filtering tricks

In [3]:
data.head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,2005-01-02,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,2005-01-18,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [83]:
filt=data['driver_race']=="White"
#pass the condition in a variable

In [85]:
filt.value_counts()

True     45747
False    19788
Name: driver_race, dtype: int64

In [82]:
data[filt].head(3)
# and pass the variable in the dataframe

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop,reduce_stop_durationtime,new_column
0,2005-01-02,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False,[0 15],20.0
1,2005-01-18,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False,[0 15],40.0
2,2005-01-23,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False,[0 15],33.0

In [12]:
data.loc[filt,'driver_gender']
# and pass the variable in the loc function

0        M
1        M
2        M
3        M
4        F
        ..
65528    M
65529    M
65530    F
65531    M
65534    F
Name: driver_gender, Length: 45747, dtype: object

In [94]:
data[data['driver_race']=='White']['driver_gender'].value_counts()

M    32473
F    13273
Name: driver_gender, dtype: int64

In [92]:
filt.value_counts()

True     45747
False    19788
Name: driver_race, dtype: int64

In [13]:
data.loc[filt,'violation_raw']

0                              Speeding
1                              Speeding
2                              Speeding
3                      Call for Service
4                              Speeding
                      ...
65528    Equipment/Inspection Violation
65529                          Speeding
65530                          Speeding
65531                          Speeding
65534                          Speeding
Name: violation_raw, Length: 45747, dtype: object

## 2nd trick with and or

In [15]:
filterr=(data['violation_raw']=='Speeding')|(data['driver_race']=='White')

In [17]:
data[filterr].head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,2005-01-02,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,2005-01-18,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [18]:
data.loc[filterr,'stop_date']

0       2005-01-02
1       2005-01-18
2       2005-01-23
3       2005-02-20
4       2005-03-14
           ...
65528   2012-12-06
65529   2012-12-06
65530   2012-12-06
65531   2012-12-06
65534   2012-12-07
Name: stop_date, Length: 52765, dtype: datetime64[ns]

In [20]:
filtered=(data['violation_raw']=='Speeding')|(data['driver_race']=='White')

In [26]:
data.loc[filtered,'stop_date']

0       2005-01-02
1       2005-01-18
2       2005-01-23
3       2005-02-20
4       2005-03-14
           ...
65528   2012-12-06
65529   2012-12-06
65530   2012-12-06
65531   2012-12-06
65534   2012-12-07
Name: stop_date, Length: 52765, dtype: datetime64[ns]

In [25]:
data.loc[filtered,'stop_date'].shape

(52765,)

In [27]:
data.loc[~filtered,'stop_date']

5       2005-03-23
22      2005-08-08
25      2005-09-03
29      2005-09-26
30      2005-09-26
           ...
65503   2012-12-06
65504   2012-12-06
65514   2012-12-06
65532   2012-12-06
65533   2012-12-07
Name: stop_date, Length: 12770, dtype: datetime64[ns]

In [24]:
data.loc[~filtered,'stop_date'].shape
# by using this trick u can fatch all other records that are not present in the first fatched data

(12770,)

In [28]:
data.loc[filtered,'stop_date'].value_counts()

2007-01-10    56
2006-05-21    55
2012-02-28    54
2007-05-16    53
2006-02-09    52
              ..
2005-03-14     1
2005-09-17     1
2007-12-25     1
2005-01-23     1
2005-07-20     1
Name: stop_date, Length: 2646, dtype: int64

## in this trick those records are present here which are not present in the filtered data

In [29]:
data.loc[~filtered,'stop_date'].value_counts()

2012-01-11    20
2012-05-25    18
2009-11-17    17
2012-02-04    17
2012-02-19    17
              ..
2007-05-17     1
2007-06-28     1
2006-11-01     1
2009-05-28     1
2006-12-18     1
Name: stop_date, Length: 2548, dtype: int64

In [31]:
data.shape

(65535, 15)

In [32]:
12770+52765

65535

In [95]:
data3=pd.read_csv("pollice data.csv")
data3.head()

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
2,1/23/2005,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
3,2/20/2005,17:15,NaN,M,1986.0,19.0,White,Call for Service,Other,False,NaN,Arrest Driver,True,16-30 Min,False
4,3/14/2005,10:00,NaN,F,1984.0,21.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

## isin() method trick

In [96]:
race=['Other','Asian']
filt=data.driver_race.isin(race)
data[filt].head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop,reduce_stop_durationtime,new_column
10,2005-07-13,16:20,NaN,M,1979.0,26.0,Asian,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False,[0 15],26.0
20,2005-07-28,12:37,NaN,F,1979.0,26.0,Asian,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False,[0 15],26.0

In [101]:
dt2=data[data['driver_race'].isin(['Other','Asian'])]
dt2.head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop,reduce_stop_durationtime,new_column
10,2005-07-13,16:20,NaN,M,1979.0,26.0,Asian,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False,[0 15],26.0
20,2005-07-28,12:37,NaN,F,1979.0,26.0,Asian,Speeding,Speeding,False,NaN,Citation,False,0 15 Min,False,[0 15],26.0

In [9]:
race=['Other','Asian']
filt=data.driver_race.isin(race)
data.loc[filt,['driver_race','driver_age','driver_age_raw']]

      driver_race  driver_age  driver_age_raw
10          Asian        26.0          1979.0
20          Asian        26.0          1979.0
37          Asian        43.0          1962.0
67          Asian        31.0          1974.0
96          Asian        55.0          1950.0
...           ...         ...             ...
65432       Asian        32.0          1980.0
65443       Asian        36.0          1976.0
65445       Asian        27.0          1985.0
65474       Asian        18.0          1994.0
65483       Asian        22.0          1990.0

[1850 rows x 3 columns]

In [13]:
se=['driver_race']
data.columns.isin(se).sum()
#for understanding the isin function

1

## contains method tricks

In [112]:
data[data['stop_outcome']=='No']

Empty DataFrame
Columns: [stop_date, stop_time, country_name, driver_gender, driver_age_raw, driver_age, driver_race, violation_raw, violation, search_conducted, search_type, stop_outcome, is_arrested, stop_duration, drugs_related_stop, reduce_stop_durationtime, new_column]
Index: []

In [34]:
data.stop_outcome.str.contains('No').value_counts()
# here i fatched those records in which contains "-----No-----"

False    61136
True       339
Name: stop_outcome, dtype: int64

In [38]:
data.stop_outcome.value_counts()[-2]

339

## 2nd method

In [42]:
# here na=False have to define it necessary because boolean broadcastin
filt=data['stop_outcome'].str.contains("No",na=False)
data.loc[filt,['stop_outcome']]    # u can use here multiple columns in a list

      stop_outcome
331      No Action
691      No Action
705      No Action
706      No Action
1760     No Action
...            ...
64974    No Action
65361    No Action
65373    No Action
65423    No Action
65487    No Action

[339 rows x 1 columns]

In [47]:
data[filt].tail(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
65423,2012-12-01,23:38,NaN,M,1973.0,39.0,Black,Motorist Assist/Courtesy,Other,False,NaN,No Action,False,0-15 Min,False
65487,2012-12-05,6:23,NaN,M,1969.0,43.0,White,Other Traffic Violation,Moving violation,False,NaN,No Action,False,0-15 Min,False

In [116]:
pd.Series(list(range(1,11))).mean()

5.5

In [118]:
pd.Series(list(range(1,6))).median()

3.0

In [119]:
pd.Series(list(range(1,11))).mode()

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [48]:
data.driver_age.median()

31.0

In [51]:
data.driver_age.mean()

34.14898412491017

In [56]:
data.median()
# median apply on the DataFrame

<ipython-input-56-135339ac59ce>:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  data.median()

country_name             NaN
driver_age_raw        1978.0
driver_age              31.0
search_conducted         0.0
is_arrested              0.0
drugs_related_stop       0.0
dtype: float64

In [57]:
data.mean()
# mean apply on the DataFrame

<ipython-input-57-abc01cf6c622>:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  data.mean()

country_name                  NaN
driver_age_raw        1967.791106
driver_age              34.148984
search_conducted         0.037827
is_arrested              0.036763
drugs_related_stop       0.007904
dtype: float64

In [124]:
data.count()

stop_date                   65535
stop_time                   65535
country_name                    0
driver_gender               61474
driver_age_raw              65535
driver_age                  61228
driver_race                 61475
violation_raw               61475
violation                   61475
search_conducted            65535
search_type                  2479
stop_outcome                61475
is_arrested                 61475
stop_duration               61475
drugs_related_stop          65535
reduce_stop_durationtime    61475
new_column                  61228
dtype: int64

## we can see here why driver gender are displaying least value

In [63]:
data.isnull().sum()

stop_date                 0
stop_time                 0
country_name          65535
driver_gender          4061
driver_age_raw         4054
                      ...
search_type           63056
stop_outcome           4060
is_arrested            4060
stop_duration          4060
drugs_related_stop        0
Length: 15, dtype: int64

In [64]:
data.std()

stop_date             793 days 04:52:40.864863560
country_name                                  NaN
driver_age_raw                         121.050106
driver_age                               12.76071
search_conducted                         0.190779
is_arrested                              0.188181
drugs_related_stop                       0.088554
dtype: object

In [65]:
data['driver_age'].std()

12.760710228138768

In [140]:
t=[2,5,8,5,6,3,3,5]
p=pd.Series(t)
print('sum',p.sum())
print('count- ',p.count())
print('mean',p.mean())
print('median',p.median())
print('std',p.std())
print('for std-',p.mean()/2)
print('var_ ', p.var())
print('unique',p.unique())
print('no_unique',p.nunique())
print('dimension',p.ndim,'\n')
print('size',p.size)

sum 37
count-  8
mean 4.625
median 5.0
std 1.9226098333849673
for std- 2.3125
var_  3.6964285714285716
unique [2 5 8 6 3]
no_unique 5
dimension 1

size 8

In [66]:
data['driver_age'].var()

162.83572552652538

In [125]:
data.describe()

       country_name    driver_age    new_column
count           0.0  61228.000000  61228.000000
mean            NaN     34.148984     34.148984
std             NaN     12.760710     12.760710
min             NaN     15.000000     15.000000
25%             NaN     23.000000     23.000000
50%             NaN     31.000000     31.000000
75%             NaN     43.000000     43.000000
max             NaN     88.000000     88.000000

In [129]:
data.select_dtypes(include='O').describe()

# there is count and unique are important thats it

,stop_time,driver_gender,driver_age_raw,driver_race,violation_raw,violation,search_type,stop_outcome,is_arrested,stop_duration,reduce_stop_durationtime
count,65535,61474,65535,61475,61475,61475,2479,61475,61475,61475,61475
unique,1432,2,94,5,12,6,23,6,2,4,3
top,11:00,M,nan,White,Speeding,Speeding,Incident to Arrest,Citation,False,0 15 Min,[0 15]
freq,280,45164,4054,45747,37204,37204,1074,56564,59215,47379,47379

## set_option is used for that how many row and columns will be display default

In [141]:
pd.set_option('display.max_columns',15)
pd.set_option('display.max_rows',10)

In [35]:
data.columns.value_counts()

drugs_related_stop    1
violation             1
stop_duration         1
stop_time             1
driver_race           1
stop_outcome          1
driver_age            1
is_arrested           1
country_name          1
stop_date             1
driver_age_raw        1
search_type           1
driver_gender         1
search_conducted      1
violation_raw         1
dtype: int64

In [143]:
filt=(data['drugs_related_stop']==True)&(data['is_arrested']==True)

In [146]:
data[filt].head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,...,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop,reduce_stop_durationtime,new_column
40,2005-10-01,0:00,NaN,M,1988.0,17.0,White,...,Probable Cause,Arrest Driver,True,16 30 Min,True,[16 30],17.0
118,2005-10-04,1:20,NaN,M,1956.0,49.0,White,...,Incident to Arrest,Arrest Driver,True,30+ Min,True,[],49.0

In [147]:
data.loc[filt].head()

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,...,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop,reduce_stop_durationtime,new_column
40,2005-10-01,0:00,NaN,M,1988.0,17.0,White,...,Probable Cause,Arrest Driver,True,16 30 Min,True,[16 30],17.0
118,2005-10-04,1:20,NaN,M,1956.0,49.0,White,...,Incident to Arrest,Arrest Driver,True,30+ Min,True,[],49.0
139,2005-10-05,0:20,NaN,M,1980.0,25.0,Black,...,"Probable Cause,Reasonable Suspicion",Arrest Driver,True,16 30 Min,True,[16 30],25.0
219,2005-10-07,23:30,NaN,M,1986.0,19.0,White,...,Probable Cause,Arrest Passenger,True,16 30 Min,True,[16 30],19.0
246,2005-10-08,20:40,NaN,M,1987.0,18.0,White,...,Probable Cause,Arrest Passenger,True,16 30 Min,True,[16 30],18.0

In [41]:
data.is_arrested

0        False
1        False
2        False
3         True
4        False
         ...
65530    False
65531    False
65532    False
65533      NaN
65534    False
Name: is_arrested, Length: 65535, dtype: object

## value counts in normalize it tells the percentage existence in records

In [6]:
data['drugs_related_stop'].value_counts()

False    65017
True       518
Name: drugs_related_stop, dtype: int64

In [10]:
data['drugs_related_stop'].value_counts(normalize=True,ascending=True)
#it tells the percentage records it means 99% false present

True     0.007904
False    0.992096
Name: drugs_related_stop, dtype: float64

In [148]:
data['violation_raw'].value_counts()

Speeding                            37204
Other Traffic Violation             11926
Equipment/Inspection Violation       6516
Special Detail/Directed Patrol       2383
Registration Violation               2243
Call for Service                      793
Violation of City/Town Ordinance      170
Motorist Assist/Courtesy              138
APB                                    51
Suspicious Person                      38
Warrant                                10
Seatbelt Violation                      3
Name: violation_raw, dtype: int64

In [149]:
filt=data['violation_raw'].str.contains('ing',na=False)
data[filt].shape


# isin(['full'])
#.str.contains('some_portion')

(37204, 17)

In [155]:
data[data['violation_raw'].str.contains('ing',na=False)]['violation_raw']

0        Speeding
1        Speeding
2        Speeding
4        Speeding
6        Speeding
           ...
65527    Speeding
65529    Speeding
65530    Speeding
65531    Speeding
65534    Speeding
Name: violation_raw, Length: 37204, dtype: object

In [157]:
data[data['violation_raw'].str.contains('ing',na=False)]['violation_raw'].shape

(37204,)

In [159]:
data['violation_raw'].value_counts()

Speeding                            37204
Other Traffic Violation             11926
Equipment/Inspection Violation       6516
Special Detail/Directed Patrol       2383
Registration Violation               2243
Call for Service                      793
Violation of City/Town Ordinance      170
Motorist Assist/Courtesy              138
APB                                    51
Suspicious Person                      38
Warrant                                10
Seatbelt Violation                      3
Name: violation_raw, dtype: int64

In [162]:
fillte=['Warning']
f=data['violation_raw'].isin(fillte)
data[f].size

0

In [31]:
data['stop_outcome'].value_counts()

Citation            56564
Arrest Driver        2009
Warning              1889
N/D                   423
No Action             339
Arrest Passenger      251
Name: stop_outcome, dtype: int64

## groupby method tricks
we can take a direct agg function on group<br>
we can retrieve based on the group column<br>
we can analyse the in grouped format but using by another columns<br>
we can analse the data by other column and take a look of more than one or single category of grouped

In [2]:
data=pd.read_csv('data.csv')        #data. is name .csv is extension
data.head()
# i will  the group by function here but first we are analyse this data for his understanding

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
0,Austria,AT,2020-W15,national,AT,Austria,1954.0,12339,8901064.0,138.623877,15.835967,Manual webscraping
1,Austria,AT,2020-W16,national,AT,Austria,773.0,58488,8901064.0,657.089984,1.321639,Manual webscraping
2,Austria,AT,2020-W17,national,AT,Austria,479.0,33443,8901064.0,375.719128,1.432288,Manual webscraping
3,Austria,AT,2020-W18,national,AT,Austria,349.0,26598,8901064.0,298.818209,1.312129,Country website
4,Austria,AT,2020-W19,national,AT,Austria,249.0,42153,8901064.0,473.572598,0.590705,Country website

In [16]:
data['country'].value_counts()

Poland           1191
Italy            1041
Spain             883
Norway            834
France            669
Austria           365
Greece            296
Denmark           279
Croatia           213
Portugal          207
Belgium           164
Lithuania         156
Finland            83
Czechia            79
Ireland            78
Slovakia           78
Estonia            77
Malta              77
Latvia             77
Slovenia           75
Iceland            75
Luxembourg         75
Hungary            74
Germany            74
Romania            73
Cyprus             73
Netherlands        73
Sweden             70
Bulgaria           61
Liechtenstein       2
Name: country, dtype: int64

## i will apply the groupby method on the country code by the coding skill

In [13]:
filt=data["country"]=='Poland'
# data[filt]
data.loc[filt,'region_name'].value_counts()
#first we fatched the poland data and secon we fatch the region_name inside the poland country and then grouped

Poland                   74
Ma?opolskie              70
Podkarpackie             70
?wi?tokrzyskie           70
?�dzkie                  70
Pomorskie                70
Warmi?sko-mazurskie      70
Kujawsko-pomorskie       70
Opolskie                 70
Dolno?l?skie             70
Zachodniopomorskie       70
Wielkopolskie            70
?l?skie                  70
Mazowiecki regionalny    70
Lubuskie                 69
Lubelskie                69
Podlaskie                69
Name: region_name, dtype: int64

In [7]:
filt=data["country"]=='Poland'
data[filt].head(2)

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
4995,Poland,PL,2020-W10,national,PL,Poland,11.0,603,37958138.0,1.588592,1.824212,TESSy
4996,Poland,PL,2020-W11,national,PL,Poland,114.0,5835,37958138.0,15.372198,1.953728,TESSy

In [15]:
data.loc[filt,'region_name'].value_counts()

Poland                   74
Ma?opolskie              70
Podkarpackie             70
?wi?tokrzyskie           70
?�dzkie                  70
Pomorskie                70
Warmi?sko-mazurskie      70
Kujawsko-pomorskie       70
Opolskie                 70
Dolno?l?skie             70
Zachodniopomorskie       70
Wielkopolskie            70
?l?skie                  70
Mazowiecki regionalny    70
Lubuskie                 69
Lubelskie                69
Podlaskie                69
Name: region_name, dtype: int64

In [17]:
data[data['country']=='Poland']['region_name'].value_counts()

Poland                   74
Ma?opolskie              70
Podkarpackie             70
?wi?tokrzyskie           70
?�dzkie                  70
Pomorskie                70
Warmi?sko-mazurskie      70
Kujawsko-pomorskie       70
Opolskie                 70
Dolno?l?skie             70
Zachodniopomorskie       70
Wielkopolskie            70
?l?skie                  70
Mazowiecki regionalny    70
Lubuskie                 69
Lubelskie                69
Podlaskie                69
Name: region_name, dtype: int64

In [25]:
data[data['country']=='Poland']['region'].value_counts().values.sum()

1191

In [12]:
data.shape

(7572, 12)

In [39]:
data[['country']].value_counts().head()

country
Poland     1191
Italy      1041
Spain       883
Norway      834
France      669
dtype: int64

In [18]:
f=['Poland']
filt=data['country'].isin(f)
data[filt].head()

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
4995,Poland,PL,2020-W10,national,PL,Poland,11.0,603,37958138.0,1.588592,1.824212,TESSy
4996,Poland,PL,2020-W11,national,PL,Poland,114.0,5835,37958138.0,15.372198,1.953728,TESSy
4997,Poland,PL,2020-W12,national,PL,Poland,509.0,13328,37958138.0,35.112365,3.819028,TESSy
4998,Poland,PL,2020-W13,national,PL,Poland,1228.0,26137,37958138.0,68.857434,4.698320,TESSy
4999,Poland,PL,2020-W14,national,PL,Poland,2240.0,39315,37958138.0,103.574627,5.697571,TESSy

In [21]:
data[data['country'].isin(['Poland'])].head()

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
4995,Poland,PL,2020-W10,national,PL,Poland,11.0,603,37958138.0,1.588592,1.824212,TESSy
4996,Poland,PL,2020-W11,national,PL,Poland,114.0,5835,37958138.0,15.372198,1.953728,TESSy
4997,Poland,PL,2020-W12,national,PL,Poland,509.0,13328,37958138.0,35.112365,3.819028,TESSy
4998,Poland,PL,2020-W13,national,PL,Poland,1228.0,26137,37958138.0,68.857434,4.698320,TESSy
4999,Poland,PL,2020-W14,national,PL,Poland,2240.0,39315,37958138.0,103.574627,5.697571,TESSy

In [22]:
f=['Spain']
filt=data['country'].isin(f)
data[filt].head()

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
6619,Spain,ES,2020-W18,national,ES,Spain,7635.0,315608,47332614.0,666.787598,2.419140,Other
6620,Spain,ES,2020-W19,national,ES,Spain,8565.0,274081,47332614.0,579.053166,3.124989,Other
6621,Spain,ES,2020-W20,national,ES,Spain,3836.0,294200,47332614.0,621.558742,1.303875,Other
6622,Spain,ES,2020-W21,national,ES,Spain,3794.0,302086,47332614.0,638.219558,1.255934,Other
6623,Spain,ES,2020-W22,national,ES,Spain,4238.0,314737,47332614.0,664.947429,1.346521,Other

In [24]:
data[data['country'].isin(['Poland','Spain'])]['country'].value_counts()

Poland    1191
Spain      883
Name: country, dtype: int64

In [26]:
data.isnull().sum()

country                 0
country_code            0
year_week               0
level                   0
region                  0
region_name             0
new_cases              19
tests_done              0
population              0
testing_rate            0
positivity_rate        24
testing_data_source     0
dtype: int64

In [36]:
pd.pivot_table(data=data,index=['country'],columns=['level'],values=['population'],aggfunc=len)

# there is length of each at the national level and subnational level

              population
level           national subnational
country
Austria             68.0       297.0
Belgium             75.0        89.0
Bulgaria            61.0         NaN
Croatia             79.0       134.0
Cyprus              73.0         NaN
Czechia             79.0         NaN
Denmark             79.0       200.0
Estonia             77.0         NaN
Finland             83.0         NaN
France              75.0       594.0
Germany             74.0         NaN
Greece              75.0       221.0
Hungary             74.0         NaN
Iceland             75.0         NaN
Ireland             78.0         NaN
Italy               75.0       966.0
Latvia              77.0         NaN
Liechtenstein        2.0         NaN
Lithuania           74.0        82.0
Luxembourg          75.0         NaN
Malta               77.0         NaN
Netherlands         73.0         NaN
Norway              75.0       759.0
Poland              74.0      1117.0
Portugal            75.0       132.0
Romania             73.0         NaN
Slovakia            78.0         NaN
Slovenia            75.0         NaN
Spain               66.0       817.0
Sweden              70.0         NaN

In [42]:
pd.pivot_table(data=data,index=['country'],columns=['level'],values=['population'],aggfunc=sum)

                 population
level              national   subnational
country
Austria        6.052724e+08  2.923396e+08
Belgium        8.641830e+08  3.370693e+08
Bulgaria       4.240404e+08           NaN
Croatia        3.205950e+08  3.764981e+07
Cyprus         6.482436e+07           NaN
Czechia        8.448212e+08           NaN
Denmark        4.599983e+08  2.322432e+08
Estonia        1.023312e+08           NaN
Finland        4.585992e+08           NaN
France         5.049016e+09  2.203558e+09
Germany        6.154337e+09           NaN
Greece         8.038924e+08  1.823182e+08
Hungary        7.229449e+08           NaN
Iceland        2.731005e+07           NaN
Ireland        3.872263e+08           NaN
Italy          4.473112e+09  2.776539e+09
Latvia         1.468910e+08           NaN
Liechtenstein  7.749400e+04           NaN
Lithuania      2.067627e+08  4.226867e+07
Luxembourg     4.695810e+07           NaN
Malta          3.962143e+07           NaN
Netherlands    1.270754e+09           NaN
Norway         4.025685e+08  3.676466e+08
Poland         2.808902e+09  2.653844e+09
Portugal       7.721932e+08  1.081002e+08
Romania        1.411005e+09           NaN
Slovakia       4.257141e+08           NaN
Slovenia       1.571896e+08           NaN
Spain          3.123953e+09  2.018294e+09
Sweden         7.229312e+08           NaN

In [44]:
pd.pivot_table(data=data,index=['country'],columns=['level'],values=['population'],aggfunc=sum)[2:3]

# and now i will proove how it is come

           population
level        national subnational
country
Bulgaria  424040402.0         NaN

In [47]:
data[data['country']=='Bulgaria']['level'].value_counts()
# as you can see there is  only single level

national    61
Name: level, dtype: int64

In [50]:
data[data['country']=='Bulgaria']['population'].sum()
# now value is prooved

424040402.0

## and now i will apply the groupby function on this data

In [51]:
grouped=data.groupby(['country'])
grouped    

# this variable contain a country column as a group and as a DataFrame
# and now we will create the group under the country

In [30]:
data['country'].value_counts()

Poland           1191
Italy            1041
Spain             883
Norway            834
France            669
Austria           365
Greece            296
Denmark           279
Croatia           213
Portugal          207
Belgium           164
Lithuania         156
Finland            83
Czechia            79
Ireland            78
Slovakia           78
Estonia            77
Malta              77
Latvia             77
Iceland            75
Luxembourg         75
Slovenia           75
Hungary            74
Germany            74
Netherlands        73
Cyprus             73
Romania            73
Sweden             70
Bulgaria           61
Liechtenstein       2
Name: country, dtype: int64

In [53]:
grouped.get_group('Poland').head()
#simply u have to change the parameter value and fetch that record

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
4995,Poland,PL,2020-W10,national,PL,Poland,11.0,603,37958138.0,1.588592,1.824212,TESSy
4996,Poland,PL,2020-W11,national,PL,Poland,114.0,5835,37958138.0,15.372198,1.953728,TESSy
4997,Poland,PL,2020-W12,national,PL,Poland,509.0,13328,37958138.0,35.112365,3.819028,TESSy
4998,Poland,PL,2020-W13,national,PL,Poland,1228.0,26137,37958138.0,68.857434,4.698320,TESSy
4999,Poland,PL,2020-W14,national,PL,Poland,2240.0,39315,37958138.0,103.574627,5.697571,TESSy

In [59]:
grouped.get_group('Bulgaria')['population'].sum()

424040402.0

# for one more than one columns and different method apply

In [39]:
grouped.get_group('Poland').agg({'positivity_rate':'sum','testing_rate':'mean'})

positivity_rate    14655.022550
testing_rate         675.962483
dtype: float64

In [61]:
grouped.get_group('Bulgaria').agg({'population':sum,'tests_done':sum})

population    424040402.0
tests_done      3536697.0
dtype: float64

In [76]:
grouped.get_group('Spain').head()

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
6619,Spain,ES,2020-W18,national,ES,Spain,7635.0,315608,47332614.0,666.787598,2.419140,Other
6620,Spain,ES,2020-W19,national,ES,Spain,8565.0,274081,47332614.0,579.053166,3.124989,Other
6621,Spain,ES,2020-W20,national,ES,Spain,3836.0,294200,47332614.0,621.558742,1.303875,Other
6622,Spain,ES,2020-W21,national,ES,Spain,3794.0,302086,47332614.0,638.219558,1.255934,Other
6623,Spain,ES,2020-W22,national,ES,Spain,4238.0,314737,47332614.0,664.947429,1.346521,Other

In [75]:
grouped2=data.groupby(['testing_data_source'])

In [95]:
grouped2.get_group('Other')[grouped2.get_group('Other')['country']=='Cyprus']

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
821,Cyprus,CY,2020-W28,national,CY,Cyprus,18.0,9471,888005.0,1066.548049,0.190054,Other
822,Cyprus,CY,2020-W29,national,CY,Cyprus,17.0,10103,888005.0,1137.718819,0.168267,Other
823,Cyprus,CY,2020-W30,national,CY,Cyprus,19.0,10703,888005.0,1205.286006,0.177520,Other
824,Cyprus,CY,2020-W31,national,CY,Cyprus,93.0,15404,888005.0,1734.674917,0.603739,Other
825,Cyprus,CY,2020-W32,national,CY,Cyprus,92.0,22959,888005.0,2585.458415,0.400714,Other
826,Cyprus,CY,2020-W33,national,CY,Cyprus,90.0,23053,888005.0,2596.043941,0.390405,Other
827,Cyprus,CY,2020-W34,national,CY,Cyprus,89.0,24751,888005.0,2787.259081,0.359581,Other
828,Cyprus,CY,2020-W35,national,CY,Cyprus,66.0,20858,888005.0,2348.860648,0.316425,Other
829,Cyprus,CY,2020-W36,national,CY,Cyprus,22.0,16347,888005.0,1840.868013,0.134581,Other
830,Cyprus,CY,2020-W37,national,CY,Cyprus,17.0,17787,888005.0,2003.029262,0.095575,Other
831,Cyprus,CY,2020-W38,national,CY,Cyprus,74.0,17670,888005.0,1989.853661,0.418789,Other
832,Cyprus,CY,2020-W39,national,CY,Cyprus,96.0,21128,888005.0,2379.265883,0.454373,Other
833,Cyprus,CY,2020-W40,national,CY,Cyprus,128.0,19817,888005.0,2231.631579,0.645910,Other
834,Cyprus,CY,2020-W41,national,CY,Cyprus,162.0,21166,888005.0,2383.545138,0.765378,Other

In [97]:
cyprus_of_other=grouped2.get_group('Other')[grouped2.get_group('Other')['country']=='Cyprus']
cyprus_of_other.head()

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
821,Cyprus,CY,2020-W28,national,CY,Cyprus,18.0,9471,888005.0,1066.548049,0.190054,Other
822,Cyprus,CY,2020-W29,national,CY,Cyprus,17.0,10103,888005.0,1137.718819,0.168267,Other
823,Cyprus,CY,2020-W30,national,CY,Cyprus,19.0,10703,888005.0,1205.286006,0.177520,Other
824,Cyprus,CY,2020-W31,national,CY,Cyprus,93.0,15404,888005.0,1734.674917,0.603739,Other
825,Cyprus,CY,2020-W32,national,CY,Cyprus,92.0,22959,888005.0,2585.458415,0.400714,Other

In [108]:
cyprus_of_other['country_code'].value_counts().index

# this is country code

Index(['CY'], dtype='object')

In [110]:
cyprus_of_other['year_week'].value_counts()

2020-W28    1
2020-W29    1
2020-W30    1
2020-W31    1
2020-W32    1
2020-W33    1
2020-W34    1
2020-W35    1
2020-W36    1
2020-W37    1
2020-W38    1
2020-W39    1
2020-W40    1
2020-W41    1
Name: year_week, dtype: int64

In [119]:
data['testing_data_source'].value_counts()

TESSy                 7267
Country website        173
Other                   37
Country API             36
Survey                  35
Country GitHub          18
Manual webscraping       6
Name: testing_data_source, dtype: int64

In [118]:
grp=data.groupby(['country'])
grp.get_group('Cyprus')['testing_data_source'].value_counts()

TESSy              41
Other              14
Country website    12
Survey              6
Name: testing_data_source, dtype: int64

# year_weak

In [139]:
year=[]
week=[]
for i in data['year_week'].str.split('-'):
    year.append(i[0])
    week.append(i[1])

In [142]:
data['year']=pd.Series(year)

In [143]:
data['week']=pd.Series(week)

In [146]:
data[['year','week']].head()
# now i will deal with week column

   year week
0  2020  W15
1  2020  W16
2  2020  W17
3  2020  W18
4  2020  W19

In [148]:
data['week']=data['week'].str.replace('W','')

In [149]:
data[['year','week']].head()

   year week
0  2020   15
1  2020   16
2  2020   17
3  2020   18
4  2020   19

In [150]:
data[['year','week']].dtypes

year    object
week    object
dtype: object

# agg function

In [157]:
data.agg({'tests_done':'sum','population':'mean'}).values[1]
# this is the mean value of population

5883504.265119902

In [158]:
data['population'].mean()

5883504.265119902

### groupby country with another columns awesome trick

In [171]:
grouped['region'].value_counts()
# this is important

country  region
Austria  AT        68
         AT11      33
         AT12      33
         AT13      33
         AT21      33
                   ..
Spain    ES62      43
         ES63      43
         ES64      43
         ES70      43
Sweden   SE        70
Name: region, Length: 154, dtype: int64

In [161]:
#country with region group by using group
grouped['region'].value_counts().head(50)
# according to this Austria have 10 region and what the region how much
####
# and now i want to fatch or display just France column next step check it

country   region
Austria   AT        68
          AT11      33
          AT12      33
          AT13      33
          AT21      33
          AT22      33
          AT31      33
          AT32      33
          AT33      33
          AT34      33
Belgium   BE        75
          BE1       30
          BE3       30
          BE2       29
Bulgaria  BG        61
Croatia   HR        79
          HR03      68
          HR02      22
          HR05      22
          HR06      22
Cyprus    CY        73
Czechia   CZ        79
Denmark   DK        79
          DK01      40
          DK02      40
          DK03      40
          DK04      40
          DK05      40
Estonia   EE        77
Finland   FI        83
France    FR        75
          FR1       33
          FRB       33
          FRC       33
          FRD       33
          FRE       33
          FRF       33
          FRG       33
          FRH       33
          FRI       33
          FRJ       33
          FRK       33
          FRL       33
          FRM       33
          FRY1      33
          FRY2      33
          FRY3      33
          FRY4      33
          FRY5      33
Germany   DE        74
Name: region, dtype: int64

In [40]:
grouped['testing_data_source'].value_counts()
#next step below

country        testing_data_source
Austria        TESSy                   339
               Country website          23
               Manual webscraping        3
Belgium        TESSy                   151
               Country website          13
Bulgaria       TESSy                    61
Croatia        TESSy                   213
Cyprus         TESSy                    41
               Other                    14
               Country website          12
               Survey                    6
Czechia        TESSy                    79
Denmark        TESSy                   243
               Country website          36
Estonia        TESSy                    66
               Country API              11
Finland        TESSy                    42
               Country API              25
               Survey                   16
France         TESSy                   669
Germany        TESSy                    74
Greece         TESSy                   296
Hungary        TESSy                    74
Iceland        TESSy                    44
               Country website          31
Ireland        TESSy                    78
Italy          TESSy                  1026
               Country GitHub           15
Latvia         TESSy                    77
Liechtenstein  TESSy                     2
Lithuania      TESSy                   133
               Country website          23
Luxembourg     TESSy                    75
Malta          TESSy                    77
Netherlands    TESSy                    73
Norway         TESSy                   834
Poland         TESSy                  1191
Portugal       TESSy                   206
               Country website           1
Romania        TESSy                    71
               Country website           2
Slovakia       TESSy                    54
               Country website          22
               Country GitHub            2
Slovenia       TESSy                    74
               Country GitHub            1
Spain          TESSy                   860
               Other                    23
Sweden         TESSy                    44
               Survey                   13
               Country website          10
               Manual webscraping        3
Name: testing_data_source, dtype: int64

In [190]:
grouped['level'].value_counts()

country   level
Austria   subnational    297
          national        68
Belgium   subnational     89
          national        75
Bulgaria  national        61
                        ...
Slovakia  national        78
Slovenia  national        75
Spain     subnational    817
          national        66
Sweden    national        70
Name: level, Length: 42, dtype: int64

In [189]:
grouped['level'].value_counts()['Austria']

level
subnational    297
national        68
Name: level, dtype: int64

In [46]:
grouped.get_group('Austria')['testing_data_source'].value_counts()
# 10 regions are presents in the Austria

TESSy                 339
Country website        23
Manual webscraping      3
Name: testing_data_source, dtype: int64

In [193]:
grouped['testing_data_source'].value_counts()['Austria']

testing_data_source
TESSy                 339
Country website        23
Manual webscraping      3
Name: testing_data_source, dtype: int64

# for grouped wise

In [50]:
grouped['level'].value_counts()

country        level
Austria        subnational     297
               national         68
Belgium        subnational      89
               national         75
Bulgaria       national         61
Croatia        subnational     134
               national         79
Cyprus         national         73
Czechia        national         79
Denmark        subnational     200
               national         79
Estonia        national         77
Finland        national         83
France         subnational     594
               national         75
Germany        national         74
Greece         subnational     221
               national         75
Hungary        national         74
Iceland        national         75
Ireland        national         78
Italy          subnational     966
               national         75
Latvia         national         77
Liechtenstein  national          2
Lithuania      subnational      82
               national         74
Luxembourg     national         75
Malta          national         77
Netherlands    national         73
Norway         subnational     759
               national         75
Poland         subnational    1117
               national         74
Portugal       subnational     132
               national         75
Romania        national         73
Slovakia       national         78
Slovenia       national         75
Spain          subnational     817
               national         66
Sweden         national         70
Name: level, dtype: int64

# for particular country in grouped

In [51]:
grouped['level'].value_counts().loc['Austria']

level
subnational    297
national        68
Name: level, dtype: int64

In [195]:
grouped.get_group('Austria')['level'].value_counts().sum()

365

In [210]:

def level_count():
    level_count=[]
    for country_name in data['country'].value_counts().index:
        level_count.append(grouped.get_group(country_name)['level'].value_counts().sum())
    return level_count

# total levels in each country by prectice

In [232]:
level_count()

[1191,
 1041,
 883,
 834,
 669,
 365,
 296,
 279,
 213,
 207,
 164,
 156,
 83,
 79,
 78,
 78,
 77,
 77,
 77,
 75,
 75,
 75,
 74,
 74,
 73,
 73,
 73,
 70,
 61,
 2]

In [233]:
data.shape

(7572, 14)

In [230]:
grouped['level'].value_counts()

country   level
Austria   subnational    297
          national        68
Belgium   subnational     89
          national        75
Bulgaria  national        61
                        ...
Slovakia  national        78
Slovenia  national        75
Spain     subnational    817
          national        66
Sweden    national        70
Name: level, Length: 42, dtype: int64

### both are same output but method different

In [56]:
grouped['testing_data_source'].value_counts().loc['Austria']
# with loc

testing_data_source
TESSy                 339
Country website        23
Manual webscraping      3
Name: testing_data_source, dtype: int64

In [57]:
grouped['testing_data_source'].value_counts()['Austria']
# without LOC parameter

testing_data_source
TESSy                 339
Country website        23
Manual webscraping      3
Name: testing_data_source, dtype: int64

## if you want to percentage value

In [61]:
data.head(2)

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
0,Austria,AT,2020-W15,national,AT,Austria,1954.0,12339,8901064.0,138.623877,15.835967,Manual webscraping
1,Austria,AT,2020-W16,national,AT,Austria,773.0,58488,8901064.0,657.089984,1.321639,Manual webscraping

# value_counts for single grouped return in percentage value

In [69]:
grouped['level'].value_counts(normalize=True).round(2)['Austria']

level
subnational    0.81
national       0.19
Name: level, dtype: float64

In [216]:
grouped.get_group('Austria')['level'].value_counts(normalize=True).round(2)

subnational    0.81
national       0.19
Name: level, dtype: float64

# for more than two feature or two grouped

In [222]:
grouped['level'].value_counts()[['Austria','Belgium','Spain']]

country  level
Austria  subnational    297
         national        68
Belgium  subnational     89
         national        75
Spain    subnational    817
         national        66
Name: level, dtype: int64

In [223]:
grouped['level'].value_counts()[['Austria','Belgium','Spain']]['Spain']

level
subnational    817
national        66
Name: level, dtype: int64

In [59]:
grouped['testing_data_source'].value_counts(normalize=True).loc[['Austria','Poland']]

country  testing_data_source
Austria  TESSy                  0.928767
         Country website        0.063014
         Manual webscraping     0.008219
Poland   TESSy                  1.000000
Name: testing_data_source, dtype: float64

In [62]:
grouped['region'].value_counts().loc['France']
# these are all region from the France by

region
FR      75
FR1     33
FRB     33
FRC     33
FRD     33
FRE     33
FRF     33
FRG     33
FRH     33
FRI     33
FRJ     33
FRK     33
FRL     33
FRM     33
FRY1    33
FRY2    33
FRY3    33
FRY4    33
FRY5    33
Name: region, dtype: int64

### get_group returns a dataframe with functionalty

In [59]:
grouped.get_group('Austria').head()

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
0,Austria,AT,2020-W15,national,AT,Austria,1954.0,12339,8901064.0,138.623877,15.835967,Manual webscraping
1,Austria,AT,2020-W16,national,AT,Austria,773.0,58488,8901064.0,657.089984,1.321639,Manual webscraping
2,Austria,AT,2020-W17,national,AT,Austria,479.0,33443,8901064.0,375.719128,1.432288,Manual webscraping
3,Austria,AT,2020-W18,national,AT,Austria,349.0,26598,8901064.0,298.818209,1.312129,Country website
4,Austria,AT,2020-W19,national,AT,Austria,249.0,42153,8901064.0,473.572598,0.590705,Country website

In [119]:
data.groupby('country').sum()['population'].head()

country
Austria     8.976119e+08
Belgium     1.201252e+09
Bulgaria    4.240404e+08
Croatia     3.582448e+08
Cyprus      6.482436e+07
Name: population, dtype: float64

In [224]:
grouped['population'].sum()
# grouped is instance of groupby

country
Austria          8.976119e+08
Belgium          1.201252e+09
Bulgaria         4.240404e+08
Croatia          3.582448e+08
Cyprus           6.482436e+07
Czechia          8.448212e+08
Denmark          6.922415e+08
Estonia          1.023312e+08
Finland          4.585992e+08
France           7.252574e+09
Germany          6.154337e+09
Greece           9.862106e+08
Hungary          7.229449e+08
Iceland          2.731005e+07
Ireland          3.872263e+08
Italy            7.249651e+09
Latvia           1.468910e+08
Liechtenstein    7.749400e+04
Lithuania        2.490313e+08
Luxembourg       4.695810e+07
Malta            3.962143e+07
Netherlands      1.270754e+09
Norway           7.702151e+08
Poland           5.462746e+09
Portugal         8.802933e+08
Romania          1.411005e+09
Slovakia         4.257141e+08
Slovenia         1.571896e+08
Spain            5.142246e+09
Sweden           7.229312e+08
Name: population, dtype: float64

## find out median value

In [111]:
grouped.mean().head()

,new_cases,tests_done,population,testing_rate,positivity_rate
country,,,,,
Austria,2642.265753,463764.624658,2.459211e+06,26471.655065,2.867624
Belgium,9750.202454,165495.408537,7.324709e+06,2550.616297,5.784331
Bulgaria,7040.350000,57978.639344,6.951482e+06,834.047177,11.582336
Croatia,2631.990610,21631.037559,1.681901e+06,4582.503001,9.360447
Cyprus,1410.625000,130416.095890,8.880050e+05,14686.414591,3.970128

In [225]:
grouped.agg({'new_cases':'sum','population':'mean','testing_rate':'mean'})

                new_cases    population  testing_rate
country
Austria          964427.0  2.459211e+06  26471.655065
Belgium         1589283.0  7.324709e+06   2550.616297
Bulgaria         422421.0  6.951482e+06    834.047177
Croatia          560614.0  1.681901e+06   4582.503001
Cyprus           101565.0  8.880050e+05  14686.414591
Czechia         1673795.0  1.069394e+07   3921.726011
Denmark          593138.0  2.481152e+06  26015.150750
Estonia          133438.0  1.328976e+06   1487.708259
Finland          107321.0  5.525292e+06   1295.789773
France         10071988.0  1.084092e+07   2815.708581
Germany         3771980.0  8.316671e+07   1099.436548
Greece           706865.0  3.331792e+06  14113.720022
Hungary          809646.0  9.769526e+06    835.758133
Iceland            8122.0  3.641340e+05   3115.779722
Ireland          299103.0  4.964440e+06   1541.157894
Italy           8421138.0  6.964122e+06   2474.590872
Latvia           138899.0  1.907675e+06   2102.978757
Liechtenstein        20.0  3.874700e+04   3102.175653
Lithuania        547235.0  1.596355e+06   8225.912305
Luxembourg        74949.0  6.261080e+05   9149.486457
Malta             34439.0  5.145640e+05   2565.185182
Netherlands     1867448.0  1.740758e+07   1692.532622
Norway           267614.0  9.235193e+05   1962.206647
Poland          5752676.0  4.586689e+06    675.962483
Portugal        1869537.0  4.252625e+06   5716.334684
Romania         1083463.0  1.932884e+07    713.630835
Slovakia         773233.0  5.457873e+06   1584.785445
Slovenia         259486.0  2.095861e+06   3847.381736
Spain           8069950.0  5.823608e+06   1986.900725
Sweden          1082697.0  1.032759e+07   1426.043387

In [80]:
grouped['tests_done'].median().head()

country
Austria     185766.0
Belgium     137929.0
Bulgaria     58036.0
Croatia      13393.0
Cyprus       52141.0
Name: tests_done, dtype: float64

In [90]:
grouped['tests_done'].median().loc['Austria']

185766.0

## total test done in different country

In [91]:
grouped['tests_done'].sum().loc['Bulgaria']

3536697

In [126]:
grouped.get_group('Poland')['tests_done'].min()

415

In [137]:
grouped['tests_done'].value_counts()[['Austria','Poland']]

country  tests_done
Austria  3032          1
         3334          1
         3383          1
         3487          1
         3723          1
                      ..
Poland   520899        1
         553882        1
         600052        1
         610218        1
         621069        1
Name: tests_done, Length: 1543, dtype: int64

## mininmum value inside the tests_done with different country

In [84]:
grouped["tests_done"].min()

country
Austria           3032
Belgium             82
Bulgaria         13137
Croatia              4
Cyprus              14
Czechia              8
Denmark              3
Estonia              1
Finland              9
France            1564
Germany          69493
Greece             200
Hungary            318
Iceland             90
Ireland              1
Italy             1071
Latvia               4
Liechtenstein     1003
Lithuania           47
Luxembourg          34
Malta                1
Netherlands      13941
Norway             367
Poland             415
Portugal            25
Romania              2
Slovakia             2
Slovenia           191
Spain              512
Sweden              11
Name: tests_done, dtype: int64

In [92]:
grouped["tests_done"].min().loc['Germany']

69493

In [89]:
grouped['tests_done'].mean().head()

country
Austria     463764.624658
Belgium     165495.408537
Bulgaria     57978.639344
Croatia      21631.037559
Cyprus      130416.095890
Name: tests_done, dtype: float64

## if you want to see mean,min,median,max,count different functionalty altogether

In [97]:
grouped["tests_done"].agg(['mean','median','min','max','count']).head()
## awesome tricks for know the more about dataset with the help of groupby

                   mean    median    min      max  count
country
Austria   463764.624658  185766.0   3032  5665559    365
Belgium   165495.408537  137929.0     82   502504    164
Bulgaria   57978.639344   58036.0  13137   111907     61
Croatia    21631.037559   13393.0      4   112673    213
Cyprus    130416.095890   52141.0     14   525868     73

## if you want to see same functionalty with but in a single country then tricks follow it , as noted below it

In [96]:
grouped["tests_done"].agg(['min','max','median','mean','count']).loc['Austria']
#here i was saw min,max,mean,count value of Austria group

min       3.032000e+03
max       5.665559e+06
median    1.857660e+05
mean      4.637646e+05
count     3.650000e+02
Name: Austria, dtype: float64

In [103]:
#such as noted above here i watched the min value of Austria 
f=data[['tests_done','country']]
g=f[f['country']=="Austria"]
g.tests_done.min()

3032

In [24]:
# grouped['testing_data_source'].str.contains('API').sum()        #IT WILL SHOW ERROR USE BELOW METHOD INSIDE THE GROUPE
grouped['testing_data_source'].apply(lambda x:x.str.contains('API'))

0       False
1       False
2       False
3       False
4       False
        ...
7567    False
7568    False
7569    False
7570    False
7571    False
Name: testing_data_source, Length: 7572, dtype: bool

In [25]:
grouped['testing_data_source'].apply(lambda x:x.str.contains('API').sum())
# where and how many times places inside the DataFrame but here i want fetch by using the group

country
Austria           0
Belgium           0
Bulgaria          0
Croatia           0
Cyprus            0
Czechia           0
Denmark           0
Estonia          11
Finland          25
France            0
Germany           0
Greece            0
Hungary           0
Iceland           0
Ireland           0
Italy             0
Latvia            0
Liechtenstein     0
Lithuania         0
Luxembourg        0
Malta             0
Netherlands       0
Norway            0
Poland            0
Portugal          0
Romania           0
Slovakia          0
Slovenia          0
Spain             0
Sweden            0
Name: testing_data_source, dtype: int64

In [32]:
data['testing_data_source'].str.contains("API").sum()

36

In [33]:
data[data['testing_data_source'].str.contains("API")].head()

,country,country_code,year_week,level,region,region_name,new_cases,tests_done,population,testing_rate,positivity_rate,testing_data_source
1234,Estonia,EE,2020-W06,national,EE,Estonia,0.0,2,1328976.0,0.150492,0.000000,Country API
1235,Estonia,EE,2020-W07,national,EE,Estonia,0.0,1,1328976.0,0.075246,0.000000,Country API
1236,Estonia,EE,2020-W08,national,EE,Estonia,0.0,1,1328976.0,0.075246,0.000000,Country API
1237,Estonia,EE,2020-W09,national,EE,Estonia,1.0,58,1328976.0,4.364262,1.724138,Country API
1238,Estonia,EE,2020-W10,national,EE,Estonia,9.0,243,1328976.0,18.284755,3.703704,Country API

## here i am creating data table iside the DataFrame first valuecount value
### and second value is contains API string how many times

In [70]:
valcount=data['testing_data_source'].value_counts()
valueexist=grouped['testing_data_source'].apply(lambda x:x.str.contains("TESSy").sum())
tabel=pd.concat([valcount,valueexist],axis='columns',sort=False)
dataframe=tabel.rename(columns={'testing_data_source':'value_count_value','testing_data_source':'ExistValue'})
dataframe.columns=['Value_count_value','ApiExistence_value']
dataframe
# and next step is add another column that are show the percentage value of ApiExistence_value

                    Value_count_value  ApiExistence_value
TESSy                          7267.0                 NaN
Country website                 173.0                 NaN
Other                            37.0                 NaN
Country API                      36.0                 NaN
Survey                           35.0                 NaN
Country GitHub                   18.0                 NaN
Manual webscraping                6.0                 NaN
Austria                           NaN               339.0
Belgium                           NaN               151.0
Bulgaria                          NaN                61.0
Croatia                           NaN               213.0
Cyprus                            NaN                41.0
Czechia                           NaN                79.0
Denmark                           NaN               243.0
Estonia                           NaN                66.0
Finland                           NaN                42.0
France                            NaN               669.0
Germany                           NaN                74.0
Greece                            NaN               296.0
Hungary                           NaN                74.0
Iceland                           NaN                44.0
Ireland                           NaN                78.0
Italy                             NaN              1026.0
Latvia                            NaN                77.0
Liechtenstein                     NaN                 2.0
Lithuania                         NaN               133.0
Luxembourg                        NaN                75.0
Malta                             NaN                77.0
Netherlands                       NaN                73.0
Norway                            NaN               834.0
Poland                            NaN              1191.0
Portugal                          NaN               206.0
Romania                           NaN                71.0
Slovakia                          NaN                54.0
Slovenia                          NaN                74.0
Spain                             NaN               860.0
Sweden                            NaN                44.0

## top 11 pandas tricks

In [234]:
data=pd.read_csv('pollice data.csv')
data.head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

## rename functin u can use here inplace

In [235]:
data.rename({'country_name':'country'},axis='columns').head()

,stop_date,stop_time,country,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
2,1/23/2005,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
3,2/20/2005,17:15,NaN,M,1986.0,19.0,White,Call for Service,Other,False,NaN,Arrest Driver,True,16-30 Min,False
4,3/14/2005,10:00,NaN,F,1984.0,21.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

## split data columns method and split method belongs to regular expression

In [237]:
data[['month','day','year']]= data['stop_date'].str.split("/",expand=True)
data[['stop_date','day','month','year']] .head(2)
## expand return value in form like
## here 3 section so i am using three variable for unpacking
# and it will modified the dataframe

   stop_date day month  year
0   1/2/2005   2     1  2005
1  1/18/2005  18     1  2005

In [238]:
data.day.value_counts().head()

7     2331
21    2326
10    2319
9     2296
5     2295
Name: day, dtype: int64

## reverese trick for split data it means merge the split columns

In [239]:
data['Date']= data['day']+'-'+data['month']+'-'+data['year']

In [240]:
data[['stop_date','day','month','year','Date']].head(2)

   stop_date day month  year       Date
0   1/2/2005   2     1  2005   2-1-2005
1  1/18/2005  18     1  2005  18-1-2005

In [241]:
data['Date'].dtypes

dtype('O')

In [251]:
pd.to_datetime(data['Date'])[0].day_name()

'Tuesday'

In [252]:
pd.to_datetime(data['Date'])[0].month_name()

'February'

In [254]:
pd.to_datetime(data['Date'])[0].year

2005

## one hot encoding

In [32]:
df=pd.get_dummies(data,prefix='month',prefix_sep='_',columns=['month'])   

# u can use here drop_first=True or False
df
# get_dummies function returning a dummy data of categorical data_column
# whenever condition met in this metho it will put the 1
# if you have 5 categoery in column then you may be seen 5 dummies column

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,...,month_11,month_12,month_2,month_3,month_4,month_5,month_6,month_7,month_8,month_9
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,...,0,0,0,0,0,0,0,0,0,0
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,...,0,0,0,0,0,0,0,0,0,0
2,1/23/2005,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,...,0,0,0,0,0,0,0,0,0,0
3,2/20/2005,17:15,NaN,M,1986.0,19.0,White,Call for Service,Other,False,...,0,0,1,0,0,0,0,0,0,0
4,3/14/2005,10:00,NaN,F,1984.0,21.0,White,Speeding,Speeding,False,...,0,0,0,1,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65530,12/6/2012,17:54,NaN,F,1987.0,25.0,White,Speeding,Speeding,False,...,0,1,0,0,0,0,0,0,0,0
65531,12/6/2012,22:22,NaN,M,1954.0,58.0,White,Speeding,Speeding,False,...,0,1,0,0,0,0,0,0,0,0
65532,12/6/2012,23:20,NaN,M,1985.0,27.0,Black,Equipment/Inspection Violation,Equipment,False,...,0,1,0,0,0,0,0,0,0,0
65533,12/7/2012,0:23,NaN,NaN,NaN,NaN,NaN,NaN,NaN,False,...,0,1,0,0,0,0,0,0,0,0
65534,12/7/2012,0:30,NaN,F,1985.0,27.0,White,Speeding,Speeding,False,...,0,1,0,0,0,0,0,0,0,0

## values function return a ndarray single dimension

In [49]:
e=data['stop_date'].values
print(e.ndim)
print(e.shape)
e

1
(65535,)

array(['1/2/2005', '1/18/2005', '1/23/2005', ..., '12/6/2012',
       '12/7/2012', '12/7/2012'], dtype=object)

## continuos variabl3 to categorical
it is my best tricks in this trick we are convert a countinuous variable into catogorical 
. when you assign the 5 bins then you will have to assign 4 labels

In [256]:
pd.cut(data['driver_age'],bins=[0,18,25,40,60,80],labels=['maner','mazer','young','old','poor_old'])

0        mazer
1        young
2        young
3        mazer
4        mazer
         ...
65530    mazer
65531      old
65532    young
65533      NaN
65534    young
Name: driver_age, Length: 65535, dtype: category
Categories (5, object): ['maner' < 'mazer' < 'young' < 'old' < 'poor_old']

In [52]:
data['categorized_age']=pd.cut(data['driver_age'].values,bins=[0,18,25,40,60,85],labels=['maner','mazer','young','old','poor_old'])
data[['driver_age','categorized_age']]

       driver_age categorized_age
0            20.0           mazer
1            40.0           young
2            33.0           young
3            19.0           mazer
4            21.0           mazer
...           ...             ...
65530        25.0           mazer
65531        58.0             old
65532        27.0           young
65533         NaN             NaN
65534        27.0           young

[65535 rows x 2 columns]

In [53]:
data['categorized_age'].value_counts()

young       22464
mazer       18634
old         16145
poor_old     2144
maner        1833
Name: categorized_age, dtype: int64

## apply() method for change case letter
i do not know about it what float object and why it not giving me suitable aswer ! but i don,t care bcz i have many method for this query

In [268]:
data['driver_race'].value_counts()

White       45747
Black        8267
Hispanic     5611
Asian        1639
Other         211
Name: driver_race, dtype: int64

In [283]:
data['driver_race']= data['driver_race'].apply(lambda x:x.upper())
data

AttributeError: 'float' object has no attribute 'upper'

In [78]:
# first we have to change the dtype into int
# after thet we will produce a new column because arithmetic operation
# con not perform on the object column
data['day']=data['day'].astype(int)
data['produced_day']= data['day'].apply(lambda x : 1 if x%2==0 else 0)

In [80]:
data[['day','produced_day']]

       day  produced_day
0        2             1
1       18             1
2       23             0
3       20             1
4       14             1
...    ...           ...
65530    6             1
65531    6             1
65532    6             1
65533    7             0
65534    7             0

[65535 rows x 2 columns]

## select_dtype() function

In [8]:
data.dtypes

stop_date             datetime64[ns]
stop_time                     object
country_name                 float64
driver_gender                 object
driver_age_raw               float64
driver_age                   float64
driver_race                   object
violation_raw                 object
violation                     object
search_conducted                bool
search_type                   object
stop_outcome                  object
is_arrested                   object
stop_duration                 object
drugs_related_stop              bool
dtype: object

In [10]:
data.select_dtypes(bool) # u can use here only two parameter include and exclude

       search_conducted  drugs_related_stop
0                 False               False
1                 False               False
2                 False               False
3                 False               False
4                 False               False
...                 ...                 ...
65530             False               False
65531             False               False
65532             False               False
65533             False               False
65534             False               False

[65535 rows x 2 columns]

In [12]:
df=data.select_dtypes(include=[float,bool])
df.dtypes
#here i am extracting only float and bool by using include parameter

country_name          float64
driver_age_raw        float64
driver_age            float64
search_conducted         bool
drugs_related_stop       bool
dtype: object

In [13]:
df=data.select_dtypes(exclude=[float,bool])
df.dtypes

stop_date        datetime64[ns]
stop_time                object
driver_gender            object
driver_race              object
violation_raw            object
violation                object
search_type              object
stop_outcome             object
is_arrested              object
stop_duration            object
dtype: object

In [15]:
df=data.select_dtypes(object)
df.dtypes

stop_time        object
driver_gender    object
driver_race      object
violation_raw    object
violation        object
search_type      object
stop_outcome     object
is_arrested      object
stop_duration    object
dtype: object